<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [614]:
import pandas as pd
import psycopg2
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

In [615]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [616]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [617]:
# текст запроса
query = f'''SELECT 
                COUNT(id) 
                from vacancies
            '''

In [618]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [619]:
# текст запроса
query = f'''SELECT 
                COUNT(id) 
                from employers
            '''

In [620]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [621]:
# текст запроса
query = f'''SELECT 
                COUNT(id) 
                from areas
            '''

In [622]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [623]:
# текст запроса
query = f'''SELECT 
                COUNT(id) 
                from industries
            '''

In [624]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    294

***

In [625]:
# выводы по предварительному анализу данных
В данном задании мы посчитали количество вакансий, количество работодатлей, количество регионов, и количество сфер деятельности по поличеству их id в таблицах

SyntaxError: invalid syntax (3919342884.py, line 2)

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [687]:
# текст запроса
query = f'''SELECT
                a.name  
            FROM 
                vacancies v
            JOIN areas a ON v.area_id = a.id
            GROUP BY  a.name /*групируем вакансии по региону*/
            ORDER BY COUNT(v.id) desc /*считаем количество вакансий*/
            LIMIT 5 /*показать первые 5 значений*/
            '''

In [688]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

              name
0           Москва
1  Санкт-Петербург
2            Минск
3      Новосибирск
4           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [ ]:
# текст запроса
query = f'''SELECT 
                COUNT(id) 
                from vacancies
                WHERE salary_from IS NOT NULL /*условие на наличие пустых значений*/
                or salary_to IS NOT NULL

            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [689]:
# текст запроса
query = f'''SELECT 
                avg(salary_from) lower,
                avg(salary_to) upper
            from vacancies
            '''

In [690]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

          lower          upper
0  71064.657901  110536.741923

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [ ]:
# текст запроса
query = f'''SELECT 
                schedule,
                employment,
                count(id)
            from vacancies
            GROUP BY schedule,  employment /*группируем по типу графика и трудоустройства*/
            ORDER BY COUNT(id) DESC 
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [ ]:
# текст запроса
query = f'''SELECT 
                experience
            from vacancies
            GROUP BY experience /*группируем по опыту работы*/
            ORDER BY COUNT(id) asc /*сортируем от большего к меньшему*/
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

           experience
0         Более 6 лет
1           Нет опыта
2       От 3 до 6 лет
3  От 1 года до 3 лет

***

In [ ]:
# выводы по детальному анализу вакансий
По юниту 4 были выполнены все задания, при помощи использования различных инструментов: группировки, сортировки, условий.
Был проанализирован рынок труда в области количества вакансий по различным критериям.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [ ]:
# текст запроса
query = f'''SELECT
                e.name  
            FROM 
                employers e
            JOIN vacancies v ON v.employer_id = e.id /*присоединяем таблицу с названием компаний*/
            GROUP BY  e.name /*групируем по названию компании*/
            ORDER BY COUNT(v.id) desc /*сортируем по количеству вакансий по убыванию*/
            LIMIT 5 /*показать первые 5 значений*/
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

            name
0         Яндекс
1     Ростелеком
2       Тинькофф
3           СБЕР
4  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [ ]:
# текст запроса
query = f'''SELECT
                a.name,
                count(e.id) AS c_empioyer,
                count(v.id) AS c_vacanties 
            FROM 
                areas a
            left JOIN vacancies v ON v.area_id = a.id
            join employers e on e.area = a.id
            where v.id is null
            GROUP BY  a.name /*групируем по названию региона*/
            ORDER BY COUNT(e.id) desc /*сортируем по количеству работадателей*/
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

                                          name  c_empioyer  c_vacanties
0                                       Россия         410            0
1                                    Казахстан         207            0
2                           Московская область          75            0
3                           Краснодарский край          19            0
4                                     Беларусь          18            0
..                                         ...         ...          ...
181                                  Миллерово           1            0
182  Михайловка (Уфимский район, Башкортостан)           1            0
183                                    Можайск           1            0
184                                Морозовск\n           1            0
185                                     Несвиж           1            0

[186 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [ ]:
# текст запроса
query = f'''SELECT
                e.name,
                count(distinct v.area_id)  
            FROM 
                employers e
            JOIN vacancies v ON v.employer_id = e.id
            GROUP BY  e.name /*групируем */
            ORDER BY COUNT(v.area_id) desc /*считаем количество вакансий*/
            LIMIT 5 /*показать первые 5 значений*/
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

            name  count
0         Яндекс    181
1     Ростелеком    152
2       Тинькофф     43
3           СБЕР     24
4  Газпром нефть     24

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [ ]:
# текст запроса
query = f'''SELECT *
            FROM 
                employers e
            left JOIN employers_industries ei on e.id = ei.employer_id
            where ei.industry_id is null
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,id,name,area,employer_id,industry_id
0,3097282,Вертикаль,3,None,None
1,2603367,Нозиков Денис Михайлович,83,None,None
2,2523114,МВД России по Республике Башкортостан,99,None,None
3,4873921,ГКУ «Центр цифровой трансформации РТ»,88,None,None
4,3182417,"Театральный музей им. А.А. Бахрушина, ФГБУК ГЦТМ",1,None,None
...,...,...,...,...,...
8414,215771,СвязьИнформ,24,None,None
8415,5596143,ГОКУ ЦОСУМС,64,None,None
8416,2835381,Сыктывкарская Швейная Фабрика Текстиль Коми,51,None,None
8417,6126288,FINOM TECH LTD,236,None,None
8418,6159826,Группа компаний Планета,22,None,None

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [ ]:
# текст запроса
query = f'''SELECT 
                e.name
            FROM 
                employers e
            left JOIN employers_industries ei on e.id = ei.employer_id
            group by e.name
            having count(ei.industry_id) = 4
            ORDER BY e.name
            
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

                 name
0        101 Интернет
1            21vek.by
2                2ГИС
3                  2К
4         4 пикселя +
...               ...
1131            ЮРИОН
1132  ЮТИП Технологии
1133           ЯКласс
1134            ЯрНео
1135    Яшин&Партнёры

[1136 rows x 1 columns]

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [ ]:
# текст запроса
query = f'''SELECT 
                count(ei.employer_id)
            FROM 
                employers_industries ei
            left JOIN industries i on i.id = ei.industry_id
            where i.name = 'Разработка программного обеспечения'
            group by i.id
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [ ]:
# код для получения списка городов-милионников
import urllib.parse as req

path_common = req.urlparse('https://ru.wikipedia.org/wiki/Города-миллионеры_России#Список_городов-миллионеров')
url = path_common.scheme + '://' + req.quote(path_common.netloc) + req.quote(path_common.path) + '#'+ req.quote(path_common.fragment)
url

'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8#%D0%A1%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%B3%D0%BE%D1%80%D0%BE%D0%B4%D0%BE%D0%B2-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D0%BE%D0%B2'

In [ ]:
pd.read_html(url)[1]

,№,Город,"Население, тыс. чел. (итоги переписи 2021 года)[5]",Прирост относительно переписи-2010,"Население, тыс. чел.(итоги переписи 2010 года)[6]"
0,1,Москва,13 010,"13,1%",11 504
1,2,Санкт-Петербург,5602,"14,8%",4880
2,3,Новосибирск,1634,"10,9%",1474
3,4,Екатеринбург,1544,"14,4%",1350
4,5,Казань,1309,"14,4%",1144
5,6,Нижний Новгород,1226,NaN,1251
6,7,Челябинск,1190,"5,3%",1130
7,8,Красноярск,1188,"21,6%",977
8,9,Самара,1173,"0,3%",1169
9,10,Уфа,1145,"7,8%",1062
10,11,Ростов-на-Дону,1142,"4,9%",1089
11,12,Омск,1126,NaN,1166
12,13,Краснодар,1099,"43,8%",764
13,14,Воронеж[a],1058,"18,9%",890
14,15,Пермь,1034,"4,3%",991
15,16,Волгоград,1028,"0,7%",1021

In [ ]:
# текст запроса
query = f''' SELECT
                a.name, 
                count(v.id) cnt    
            from employers e
            join vacancies v on e.id = v.employer_id
            join areas a on v.area_id = a.id
            where e.name = 'Яндекс' 
            and a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград')
            group by a.name
            
            
            UNION all
            
            SELECT
                'total',
                sum(cnt)    
            FROM table_1
            ORDER BY cnt asc

            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

               name    cnt
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7            Самара   26.0
8               Уфа   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            total  970.0

***

In [ ]:
# выводы по анализу работодателей
В данном юните мы проанализировали работадателей:
    1. Выявили работодатлей с самым большим количеством вакансий,
    2.определили, в каком регионе самое большое количество вакансий - в России,
    3. Просчитали количество регионов, в котрых были размещены вакансии работодателей,
    4. Проанализировали сферы деятельности работодателей (у большинства работодателей не указана сфера деятельности),
    5. Также проанализировали вакансии компании Яндекс

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [ ]:
# текст запроса
query = f'''SELECT 
                count(*)
            FROM vacancies
            WHERE name ilike '%data%' or name ilike '%данн%'
                
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [ ]:
# текст запроса
query = f'''SELECT 
                count(*)
            FROM vacancies
            WHERE 
                (name ilike '%data scientist%' 
                or name ilike '%data science%' 
                or name ilike '%исследователь данных%'
                or (name like '%ML%' and name not like '%HTML%')
                or name ilike '%machine learning%'
                or name ilike '%машинн%обучен%')
                and 
                (employment ilike '%Стажировка%' 
                or experience ilike'%Нет опыта%' 
                or name ilike '%junior%')
            
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [ ]:
# текст запроса
query = f'''SELECT 
                count(*)
            FROM vacancies
            WHERE 
                (key_skills ilike '%sql%'
                or key_skills ilike '%postgress%')
                and
                (name ilike '%data scientist%' 
                or name ilike '%data science%' 
                or name ilike '%исследователь данных%'
                or (name like '%ML%' and name not like '%HTML%')
                or name ilike '%machine learning%'
                or name ilike '%машинн%обучен%')
                
            
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [ ]:
# текст запроса
query = f'''SELECT 
                count(*)
            FROM vacancies
            WHERE 
                key_skills ilike '%Python%'
               
                and
                (name ilike '%data scientist%' 
                or name ilike '%data science%' 
                or name ilike '%исследователь данных%'
                or (name like '%ML%' and name not like '%HTML%')
                or name ilike '%machine learning%'
                or name ilike '%машинн%обучен%')
                
            
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [ ]:
# текст запроса
query = f'''SELECT 
                round(avg(length(key_skills)-length(replace(key_skills, CHR(9),''))+1),2)
            FROM vacancies
            WHERE 
                key_skills is not null
                and
               (name ilike '%data scientist%' 
                or name ilike '%data science%' 
                or name ilike '%исследователь данных%'
                or (name like '%ML%' and name not like '%HTML%')
                or name ilike '%machine learning%'
                or name ilike '%машинн%обучен%')
            '''

In [ ]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [685]:
# текст запроса
query = f'''
WITH data_vacs AS(
SELECT *
FROM public.vacancies
WHERE
name ilike '%data scientist%' 
or name ilike '%data science%' 
or name ilike '%исследователь данных%'
or (name like '%ML%' and name not like '%HTML%')
or name ilike '%machine learning%'
or name ilike '%машинн%обучен%'
),

average_salary AS(
SELECT experience,
salary_from,
salary_to,
CASE WHEN salary_from IS NOT Null AND salary_to IS NOT Null THEN (salary_from + salary_to)/2
WHEN salary_from IS Null AND salary_to IS NOT Null THEN salary_to
WHEN salary_from IS NOT Null AND salary_to IS Null THEN salary_from
END AS salary
FROM data_vacs
WHERE salary_from IS NOT Null OR salary_to IS NOT Null
)

SELECT experience,
AVG(salary)
FROM average_salary
GROUP BY experience
'''

In [686]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

c:\Users\Света\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           experience            avg
0       От 3 до 6 лет  243114.666667
1  От 1 года до 3 лет  139674.750000
2           Нет опыта   74642.857143

***

In [ ]:
# выводы по предметному анализу
С помощью агрегатных функций мы провели анализ требований работодателей к дата-сайентистам;
1. Определили, что 1771 вакансий имеют отношения к данным, что составляет 3,6% от общего количества вакансий в базе.
2. Посчитали, что 51 вакансия подойдет начинающим дата-сайентистам;
3. Выяснили, что 201 вакансия для DS, в которых в качестве ключевого навыка указан SQL или postgres;
4. 351 вакансия, в которых в качестве ключевого навыка указан Python;
5. В среднем 6 ключевых навыков указывают работадатели в вакансиях для DS;
Средняя зп для дата-сайентистов с оптом работы от 3 до 6 лет, которую предлагаю работадателя составляет 243115 рублей, а с опытом от 1 года до 3 лет - 139 674 рубля.

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
Итогом исследования можно считать, что с помощью запосов SQL можно полноценно провести анализ большой базы данный.